switch => 50 sec pakcet send updation for mac table
first time broadcast for mactable

ROUTER

default gateway is for connecting
diff network one gateway is reqd
that is ip of router

Router> signifies
userview mode

router# = admin mode / config mode

config terminal for entering terminal mode
hostname (your name) to change the name of the router
exit for enetering from the router

```
       --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: no

Press RETURN to get started!


Router>?
Exec commands:
  <1-99>      Session number to resume
  connect     Open a terminal connection
  disable     Turn off privileged commands
  disconnect  Disconnect an existing network connection
  enable      Turn on privileged commands
  exit        Exit from the EXEC
  logout      Exit from the EXEC
  ping        Send echo messages
  resume      Resume an active network connection
  show        Show running system information
  ssh         Open a secure shell client connection
  telnet      Open a telnet connection
  terminal    Set terminal line parameters
  traceroute  Trace route to destination
Router>enable
Router#?
Exec commands:
  <1-99>      Session number to resume
  auto        Exec level Automation
  clear       Reset functions
  clock       Manage the system clock
  configure   Enter configuration mode
  connect     Open a terminal connection
  copy        Copy from one file to another
  debug       Debugging functions (see also 'undebug')
  delete      Delete a file
  dir         List files on a filesystem
  disable     Turn off privileged commands
  disconnect  Disconnect an existing network connection
  enable      Turn on privileged commands
  erase       Erase a filesystem
  exit        Exit from the EXEC
  logout      Exit from the EXEC
  mkdir       Create new directory
  more        Display the contents of a file
  no          Disable debugging informations
  ping        Send echo messages
  reload      Halt and perform a cold restart

Router#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname Rohit
Rohit(config)#exit
Rohit#
%SYS-5-CONFIG_I: Configured from console by console
show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     unassigned      YES unset  administratively down down
GigabitEthernet0/1     unassigned      YES unset  administratively down down
Vlan1                  unassigned      YES unset  administratively down down
Rohit#
```

### router configuration

take one router and two switch with 4 pcs
make connection b/w them
write network address for both the switches
start the router first (red wire show it is off / no connection)
ip of switch is gateway address for the network

ip address with CLI
ip address {value} {default subnet mask}
for getting ip 
> exit
> exit
> show ip interface brief

```
Rohit(config-if)#exit
Rohit(config)#exit
Rohit#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0     172.10.10.1     YES manual up                    up 
GigabitEthernet0/1     112.11.12.1     YES manual up                    up 
Vlan1                  unassigned      YES unset  administratively down down
Rohit#
```

router -> switch 
stp on switch
spanning tree Protocol - to stop loop inside a switch
time delay = 50sec

rstp
time delay = 2sec
stp mode rstp

VLSM variable length
FLSM fixed length
subnet=> making creating a small blocks from large block

router example of dhcp

subnetting always works on static
255.255.240.0
classless ip address changable
ipv4 class full and class less

10.11.10.1/28
n = Total length - /n value
tl = 32 bits
n = 32 - 28
n=4 
2^4 = 16

ip range

10.10.11.0 network address 
. 
.
.
.
.
10.10.11.15 broadcast address

/n = 22
2^10 = 1024
8.8.8.8
_ _ 2^2 2^8

block 1
10.10.0.0
.
.
.
10.10.3.255

block 2
10.10.4.0
.
.
.
10.10.7.255

/n = 15
32-15 = 17
0 1 8 8

block 1
10.0.0.0
10.1.255.255

block 2
10.2.0.0
10.3.255.255

router has 2 interface
gateway = ip of router

static routing
new ip for the 2nd interface

interface 0 => ip address of switch 1
interface 1 => ip address of switch 2

routing -> static ->
network = network address of router1
mask = subnet mask
next hop = ip of switch 2 (in network 2)